In [2]:
import pandas as pd

# Series

In [3]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
index_s = ['a', 'b', 'c', 'd', 'e']
ser = pd.Series([1, 2, 3, 4, 5], index=index_s)  # 데이터와 인덱스의 길이가 다르면 안됨
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
ser[0], ser['a']

C:\Users\Admin\AppData\Local\Temp\ipykernel_15176\1772165095.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0], ser['a']

(np.int64(1), np.int64(1))

In [9]:
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
ser1 = pd.Series(dict_data)
ser1

a    1
b    2
c    3
d    4
dtype: int64

In [13]:
ser2 = pd.Series([10, 'banana'])
type(ser2), ser2  # dtype: object  -> 더 큰 자료형 기준

(pandas.core.series.Series,
 0        10
 1    banana
 dtype: object)

In [14]:
population = pd.Series([9776, 2729, 1566, 3158], index=['서울', '부산', '인천', '대구'])
population

서울    9776
부산    2729
인천    1566
대구    3158
dtype: int64

In [19]:
print(population['서울'])
print(population[['서울', '부산']])  # 0, 1  팬시 인덱싱

9776
서울    9776
부산    2729
dtype: int64

In [20]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [24]:
# 숫자 인덱스를 활용하여 호출힐 때 iloc 사용!
ser.iloc[0]

np.int64(1)

In [ ]:
# 인덱스 이름으로 직접 호출힐 때 iloc 사용!
ser.loc['a']

np.int64(1)

`iloc[]` : indexlocator    
`loc[]` : locator

# DataFrame

In [28]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [29]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [31]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [32]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [34]:
scientists['Age']

0    37
1    61
Name: Age, dtype: int64

In [35]:
scientists.index = ['Rosaline Franklin', 'William Gosset']
scientists

,Name,Occupation,Born,Died,Age
Rosaline Franklin,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37
William Gosset,William Gosset,Statistician,1876-06-13,1937-10-16,61

In [36]:
scientists.loc['William Gosset']

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [37]:
scientists.iloc[1]

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [41]:
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

df = pd.DataFrame(data)
print(df)

df = pd.DataFrame(data, columns=['A', 'B', 'C'])  # 열 이름 지정
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [43]:
import numpy as np

# 넘파이 어레이로 데이터프레임 생성
arr = np.arange(1, 10).reshape(3, 3)
df = pd.DataFrame(arr, columns=['A', 'B', 'C'])
print(df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [58]:
# 시리즈로 데이터프레임 생성
names = pd.Series(['김사과', '이바나', '박포도'])
ages = pd.Series([25, 28, 22])
scores = pd.Series([85, 92, 77])

df = pd.DataFrame({
    '이름': names,
    '나이': ages,
    '점수': scores
})

df.index = [1, 2, 3]
df.index.name = '번호'
print(df)

     이름  나이  점수
번호
1   김사과  25  85
2   이바나  28  92
3   박포도  22  77

In [ ]:
# 이건 왜 안되징..........
df = pd.DataFrame({
    '이름': names,
    '나이': ages,
    '점수': scores
}, index = [1, 2, 3])

df

    이름    나이    점수
1  이바나  28.0  92.0
2  박포도  22.0  77.0
3  NaN   NaN   NaN

names, ages, scores는 전부 인덱스 [0, 1, 2]임

그런데 DataFrame은 index=[1, 2, 3]이라고 지정했어

그러면 판다스는 각 Series에서 "1, 2, 3 인덱스를 찾으려고 함"

0 인덱스에 있는 값은 누락되고 3은 Series에 없으니까 NaN

In [56]:
df = pd.DataFrame({
    '이름': ['김사과', '이바나', '박포도'],
    '나이': [25, 28, 22],
    '점수': [85, 92, 77]
}, index = [1, 2, 3])

df

    이름  나이  점수
1  김사과  25  85
2  이바나  28  92
3  박포도  22  77

In [60]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [61]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [62]:
sci1.loc[0, 'Occupation']

'Chemist'

In [63]:
sci1.to_csv('./data/scientist_1.csv')

In [67]:
# 인덱스는 빼고 저장 <- 더 편리함
sci1.to_csv('./data/scientist_2.csv', index=False)

In [71]:
df = pd.read_csv('./data/scientist_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [76]:
# pickle: 파이썬의 객체형을 저장 (캡슐화)
sci1.to_pickle('./data/scientist.pickle')

In [77]:
df2 = pd.read_pickle('./data/scientist.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [70]:
df1 = pd.read_csv('./data/scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

# 데이터 미리보기
1. info()
2. head() 와 tail() -> default 5개

In [79]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [78]:
df1.head(3)

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse

In [80]:
df1.tail(3)

           Name        Born        Died  Age          Occupation
5     John Snow  1813-03-15  1858-06-16   45           Physician
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [81]:
df1.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [83]:
df1['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [85]:
df1.loc[:, 'Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [88]:
data = {
    '이름': ['김사과', '이딸기', '박포도', '정바나', '최모과', '한수박', '윤낑깡'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김사과  25  85
1  이딸기  28  92
2  박포도  22  78
3  정바나  31  95
4  최모과  27  88
5  한수박  24  73
6  윤낑깡  29  91

In [94]:
df.shape

(7, 3)

In [95]:
df.values

array([['김사과', 25, 85],
       ['이딸기', 28, 92],
       ['박포도', 22, 78],
       ['정바나', 31, 95],
       ['최모과', 27, 88],
       ['한수박', 24, 73],
       ['윤낑깡', 29, 91]], dtype=object)

In [90]:
# 행 이름 변경
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
print(df.index)

# 모든 열 이름 한번에 변경
df.columns = ['name', 'age', 'score']
print(df.columns)

df

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype='object')
Index(['name', 'age', 'score'], dtype='object')

  name  age  score
A  김사과   25     85
B  이딸기   28     92
C  박포도   22     78
D  정바나   31     95
E  최모과   27     88
F  한수박   24     73
G  윤낑깡   29     91

In [93]:
# rename() 메서드 : 딕셔너리를 사용하여 특정 열과 행의 이름을 변경
df.rename(index={"A":"a", "B": "b"}, inplace=True)
df

  name  age  score
a  김사과   25     85
b  이딸기   28     92
C  박포도   22     78
D  정바나   31     95
E  최모과   27     88
F  한수박   24     73
G  윤낑깡   29     91